In [2]:
import pandas as pd

dow_jones = pd.read_csv('^DJI.csv')
dow_jones = dow_jones.drop(["High","Low","Adj Close","Volume"],axis = 1)
dow_jones

            Date          Open         Close
0     1985-01-29   1277.719971   1292.619995
1     1985-01-30   1297.369995   1287.880005
2     1985-01-31   1283.239990   1286.770020
3     1985-02-01   1276.939941   1277.719971
4     1985-02-04   1272.079956   1290.079956
...          ...           ...           ...
8867  2020-04-03  21285.929688  21052.529297
8868  2020-04-06  21693.630859  22679.990234
8869  2020-04-07  23537.439453  22653.859375
8870  2020-04-08  22893.470703  23433.570313
8871  2020-04-09  23690.660156  23719.369141

[8872 rows x 3 columns]

In [3]:
snp_500 = pd.read_csv('^GSPC.csv')
snp_500 = snp_500.drop(["High","Low","Adj Close","Volume"],axis = 1)
snp_500

             Date         Open        Close
0      1927-12-30    17.660000    17.660000
1      1928-01-03    17.760000    17.760000
2      1928-01-04    17.719999    17.719999
3      1928-01-05    17.549999    17.549999
4      1928-01-06    17.660000    17.660000
...           ...          ...          ...
23173  2020-04-03  2514.919922  2488.649902
23174  2020-04-06  2578.280029  2663.679932
23175  2020-04-07  2738.649902  2659.409912
23176  2020-04-08  2685.000000  2749.979980
23177  2020-04-09  2776.989990  2789.820068

[23178 rows x 3 columns]

In [5]:
quarter_gdp = pd.read_csv('quarter_csv.csv')
quarter_gdp = quarter_gdp.drop(["level-chained","change-current","change-chained"],axis = 1)
quarter_gdp

           date  level-current
0    1947-04-01          246.3
1    1947-07-01          250.1
2    1947-10-01          260.3
3    1948-01-01          266.2
4    1948-04-01          272.9
..          ...            ...
276  2016-04-01        18538.0
277  2016-07-01        18729.1
278  2016-10-01        18905.5
279  2017-01-01        19057.7
280  2017-04-01        19250.0

[281 rows x 2 columns]

In [6]:
year_gdp = pd.read_csv('year_csv.csv')
year_gdp = year_gdp.drop(["level-chained","change-current","change-chained"],axis = 1)
year_gdp

    date  level-current
0   1930           92.2
1   1931           77.4
2   1932           59.5
3   1933           57.2
4   1934           66.8
..   ...            ...
81  2011        15517.9
82  2012        16155.3
83  2013        16691.5
84  2014        17427.6
85  2015        18120.7

[86 rows x 2 columns]

In [36]:
import numpy as np
yield_curve = pd.read_csv('yeild_curve_data - Sheet1 (1).csv')

yield_curve

,Date,1 Mo,2 Mo,3 Mo,6 Mo,1 Yr,2 Yr,3 Yr,5 Yr,7 Yr,10 Yr,20 Yr,30 Yr
0,01/03/00,NaN,NaN,5.48,5.81,6.09,6.38,6.42,6.50,6.65,6.58,6.94,6.61
1,01/04/00,NaN,NaN,5.43,5.75,6.00,6.30,6.34,6.40,6.56,6.49,6.84,6.53
2,01/05/00,NaN,NaN,5.44,5.74,6.05,6.38,6.43,6.51,6.68,6.62,6.95,6.64
3,01/06/00,NaN,NaN,5.41,5.69,6.03,6.35,6.39,6.46,6.63,6.57,6.86,6.58
4,01/07/00,NaN,NaN,5.38,5.66,6.00,6.31,6.35,6.42,6.58,6.52,6.82,6.55
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5068,04/06/20,0.09,0.13,0.15,0.17,0.20,0.27,0.35,0.44,0.58,0.67,1.08,1.27
5069,04/07/20,0.10,0.13,0.14,0.20,0.20,0.28,0.36,0.48,0.64,0.75,1.13,1.32
5070,04/08/20,0.14,0.17,0.22,0.24,0.23,0.27,0.34,0.47,0.65,0.77,1.18,1.37
5071,04/09/20,0.20,0.27,0.25,0.24,0.25,0.23,0.29,0.41,0.60,0.73,1.15,1.35
5072,04/13/20,0.17,0.29,0.26,0.27,0.27,0.25,0.31,0.44,0.63,0.76,1.19,1.39

In [37]:

dow_list = []

for row_ind,row in dow_jones.iterrows():
    string_month = row[0][5:7]
    string_year = row[0][2:4]
    for row_ind2,row2 in quarter_gdp.iterrows():
        string2_month = row2[0][5:7]
        string2_year = row2[0][2:4]
        if(string2_month == string_month) and (string_year == string2_year):
            row_tup = (row[0],row[1],row[2],row2[1])
            dow_list.append(row_tup)
dow_arr = np.array(dow_list)
dow_arr.shape

(2729, 4)

In [40]:
snp_list = []

for row_ind,row in snp_500.iterrows():
    string_month = row[0][5:7]
    string_year = row[0][2:4]
    for row_ind2,row2 in quarter_gdp.iterrows():
        string2_month = row2[0][5:7]
        string2_year = row2[0][2:4]
        if(string2_month == string_month) and (string_year == string2_year):
            row_tup = (row[0],row[1],row[2],row2[1])
            snp_list.append(row_tup)
snp_arr = np.array(snp_list)
snp_arr.shape

(5943, 4)

In [41]:
yield_list = []

for row_ind, row in yield_curve.iterrows():
    string_month = row[0][0:2]
    string_year = row[0][6:8]
    for row_ind2,row2 in quarter_gdp.iterrows():
        string2_month = row2[0][5:7]
        string2_year = row2[0][2:4]
        if(string2_month == string_month) and (string_year == string2_year):
            row_list = []
            for item in row:
                row_list.append(item)
            yield_list.append(row_list)
yield_arr = np.array(yield_list)
yield_arr.shape

(1459, 13)

'ka'